In [10]:
import yfinance as yf 
import pandas as pd

In [12]:
START, END = '2015-1-1', '2020-12-31'

# Apple

In [15]:
df_apple = yf.Ticker('AAPL').history(start=START, end=END)
df_apple.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2015-01-02 00:00:00-05:00,24.718174,24.729270,23.821672,24.261047,212818400,0.0,0.0
2015-01-05 00:00:00-05:00,24.030267,24.110154,23.391177,23.577578,257142000,0.0,0.0
2015-01-06 00:00:00-05:00,23.641929,23.839426,23.218087,23.579796,263188400,0.0,0.0
2015-01-07 00:00:00-05:00,23.788380,24.010286,23.677426,23.910429,160423600,0.0,0.0
2015-01-08 00:00:00-05:00,24.238858,24.886824,24.121246,24.829128,237458000,0.0,0.0

In [31]:
df_apple.to_csv('apple_stock_data_raw.csv')

In [33]:
_df = pd.read_csv('apple_stock_data_raw.csv')
_df.head()

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
0,2015-01-02 00:00:00-05:00,24.718174,24.729270,23.821672,24.261047,212818400,0.0,0.0
1,2015-01-05 00:00:00-05:00,24.030267,24.110154,23.391177,23.577578,257142000,0.0,0.0
2,2015-01-06 00:00:00-05:00,23.641929,23.839426,23.218087,23.579796,263188400,0.0,0.0
3,2015-01-07 00:00:00-05:00,23.788380,24.010286,23.677426,23.910429,160423600,0.0,0.0
4,2015-01-08 00:00:00-05:00,24.238858,24.886824,24.121246,24.829128,237458000,0.0,0.0

In [35]:
_df.set_index('Date', inplace=True)
_df.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2015-01-02 00:00:00-05:00,24.718174,24.729270,23.821672,24.261047,212818400,0.0,0.0
2015-01-05 00:00:00-05:00,24.030267,24.110154,23.391177,23.577578,257142000,0.0,0.0
2015-01-06 00:00:00-05:00,23.641929,23.839426,23.218087,23.579796,263188400,0.0,0.0
2015-01-07 00:00:00-05:00,23.788380,24.010286,23.677426,23.910429,160423600,0.0,0.0
2015-01-08 00:00:00-05:00,24.238858,24.886824,24.121246,24.829128,237458000,0.0,0.0

# Close Data

In [43]:
STOCK_DICT = {'Apple': 'AAPL', 'Tesla': 'TSLA', 'Amazon': 'AMZN', 'Visa': 'V', 'Microsoft': 'MSFT'}
START = '2015-1-1'
END = '2020-12-31'

In [45]:
df_close = pd.DataFrame()

for name, symbol in STOCK_DICT.items():
    df_close[name] = yf.Ticker(symbol).history(start=START, end=END).Close
    
df_close.head().round(2)

                           Apple  Tesla  Amazon   Visa  Microsoft
Date
2015-01-02 00:00:00-05:00  24.26  14.62   15.43  61.46      39.93
2015-01-05 00:00:00-05:00  23.58  14.01   15.11  60.11      39.57
2015-01-06 00:00:00-05:00  23.58  14.09   14.76  59.72      38.99
2015-01-07 00:00:00-05:00  23.91  14.06   14.92  60.52      39.48
2015-01-08 00:00:00-05:00  24.83  14.04   15.02  61.33      40.64

In [41]:
df_close.to_csv('close_stock_data_raw.csv')

In [47]:
_df_close = pd.read_csv('close_stock_data_raw.csv')
_df_close.head()

,Date,Apple,Tesla,Amazon,Visa,Microsoft
0,2015-01-02 00:00:00-05:00,24.261047,14.620667,15.4260,61.462486,39.933056
1,2015-01-05 00:00:00-05:00,23.577578,14.006000,15.1095,60.105762,39.565842
2,2015-01-06 00:00:00-05:00,23.579796,14.085333,14.7645,59.718475,38.985107
3,2015-01-07 00:00:00-05:00,23.910429,14.063333,14.9210,60.518589,39.480442
4,2015-01-08 00:00:00-05:00,24.829128,14.041333,15.0230,61.330284,40.641880